stm32-rs/stm32g4xx-hal/src/serial/usart.rs
use core::fmt;
use core::marker::PhantomData;

use crate::dma::{
    mux::DmaMuxResources, traits::TargetAddress, MemoryToPeripheral, PeripheralToMemory,
};
use crate::gpio::{gpioa::*, gpiob::*, gpioc::*, gpiod::*, gpioe::*, gpiog::*};
use crate::gpio::{Alternate, AlternateOD, AF12, AF5, AF7, AF8};
use crate::prelude::*;
use crate::rcc::{Enable, GetBusFreq, Rcc, RccBus, Reset};
use crate::stm32::*;

use cortex_m::interrupt;
use nb::block;

use crate::serial::config::*;
/// Serial error
#[derive(Debug)]
pub enum Error {
    /// Framing error
    Framing,
    /// Noise error
    Noise,
    /// RX buffer overrun
    Overrun,
    /// Parity check error
    Parity,
}

/// Interrupt event
pub enum Event {
    /// TXFIFO reaches the threshold
    TXFT = 1 << 27,
    /// This bit is set by hardware when the threshold programmed in RXFTCFG in USART_CR3 register is reached.
    RXFT = 1 << 26,

    /// RXFIFO full
    RXFF = 1 << 24,
    /// TXFIFO empty
    TXFE = 1 << 23,

    /// Active when a communication is ongoing on the RX line
    BUSY = 1 << 16,

    /// Receiver timeout.This bit is set by hardware when the timeout value,
    /// programmed in the RTOR register has lapsed, without any communication.
    RTOF = 1 << 11,
    /// Transmit data register empty. New data can be sent
    Txe = 1 << 7,

    /// Transmission Complete. The last data written in the USART_TDR has been transmitted out of the shift register.
    TC = 1 << 6,
    /// New data has been received
    Rxne = 1 << 5,
    /// Idle line state detected
    Idle = 1 << 4,

    /// Overrun error
    ORE = 1 << 3,

    /// Noise detection flag
    NE = 1 << 2,

    /// Framing error
    FE = 1 << 1,

    /// Parity error
    PE = 1 << 0,
}
impl Event {
    fn val(self) -> u32 {
        self as u32
    }
}

/// Serial receiver
pub struct Rx<USART, Pin, Config, Dma> {
    pin: Pin,
    _usart: PhantomData<USART>,
    _config: PhantomData<Config>,
    _dma: PhantomData<Dma>,
}

/// Serial transmitter
pub struct Tx<USART, Pin, Config, Dma> {
    pin: Pin,
    usart: USART,
    _config: PhantomData<Config>,
    _dma: PhantomData<Dma>,
}

/// Serial abstraction
pub struct Serial<USART, TXPin, RXPin, Config> {
    tx: Tx<USART, TXPin, Config, NoDMA>,
    rx: Rx<USART, RXPin, Config, NoDMA>,
    _config: PhantomData<Config>,
}

/// Serial TX pin
pub trait TxPin<USART> {}

/// Serial RX pin
pub trait RxPin<USART> {}

pub struct NoTx;

impl<USART> TxPin<USART> for NoTx {}

/// Type state for Tx/Rx, indicating operation without DMA
#[derive(Debug)]
pub struct NoDMA;
/// Type state for Tx/Rx, indicating configuration for DMA
#[derive(Debug)]
pub struct DMA;

pub trait SerialExt<USART, Config> {
    fn usart<TX, RX>(
        self,
        tx: TX,
        rx: RX,
        config: Config,
        rcc: &mut Rcc,
    ) -> Result<Serial<USART, TX, RX, Config>, InvalidConfig>
    where
        TX: TxPin<USART>,
        RX: RxPin<USART>;
}

impl<USART, TX, RX, Config> fmt::Write for Serial<USART, TX, RX, Config>
where
    Serial<USART, TX, RX, Config>: hal::serial::Write<u8>,
{
    fn write_str(&mut self, s: &str) -> fmt::Result {
        let _ = s.as_bytes().iter().map(|c| block!(self.write(*c))).last();
        Ok(())
    }
}

impl<USART, Pin, Config, Dma> fmt::Write for Tx<USART, Pin, Config, Dma>
where
    Tx<USART, Pin, Config, Dma>: hal::serial::Write<u8>,
{
    fn write_str(&mut self, s: &str) -> fmt::Result {
        let _ = s.as_bytes().iter().map(|c| block!(self.write(*c))).last();
        Ok(())
    }
}

macro_rules! uart_shared {
    ($USARTX:ident, $dmamux_rx:ident, $dmamux_tx:ident,
        tx: [ $($( #[ $pmeta1:meta ] )* ($PTX:ident, $TAF:expr),)+ ],
        rx: [ $($( #[ $pmeta2:meta ] )* ($PRX:ident, $RAF:expr),)+ ]) => {

        $(
            $( #[ $pmeta1 ] )*
            impl TxPin<$USARTX> for $PTX<Alternate<$TAF>> {
            }
            impl TxPin<$USARTX> for $PTX<AlternateOD<$TAF>> {
            }
        )+

        $(
            $( #[ $pmeta2 ] )*
            impl RxPin<$USARTX> for $PRX<Alternate<$RAF>> {
            }
        )+

        impl<Pin, Config, Dma> Rx<$USARTX, Pin, Config, Dma> {
            /// Starts listening for an interrupt event
            pub fn listen(&mut self) {
                let usart = unsafe { &(*$USARTX::ptr()) };
                usart.cr1.modify(|_, w| w.rxneie().set_bit());
            }

            /// Stop listening for an interrupt event
            pub fn unlisten(&mut self) {
                let usart = unsafe { &(*$USARTX::ptr()) };
                usart.cr1.modify(|_, w| w.rxneie().clear_bit());
            }

            /// Return true if the rx register is not empty (and can be read)
            pub fn is_rxne(&self) -> bool {
                let usart = unsafe { &(*$USARTX::ptr()) };
                usart.isr.read().rxne().bit_is_set()
            }
        }

        impl<Pin, Config> Rx<$USARTX, Pin, Config, NoDMA> {
            pub fn enable_dma(self) -> Rx<$USARTX, Pin, Config, DMA> {
                // NOTE(unsafe) critical section prevents races
                cortex_m::interrupt::free(|_| unsafe {
                    let cr3 = &(*$USARTX::ptr()).cr3;
                    cr3.modify(|_, w| w.dmar().set_bit());
                });

                Rx {
                    pin: self.pin,
                    _usart: PhantomData,
                    _config: PhantomData,
                    _dma: PhantomData,
                }
            }
        }

        impl<Pin, Config> Rx<$USARTX, Pin, Config, DMA> {
            pub fn disable_dma(self) -> Rx<$USARTX, Pin, Config, NoDMA> {
                // NOTE(unsafe) critical section prevents races
                interrupt::free(|_| unsafe {
                    let cr3 = &(*$USARTX::ptr()).cr3;
                    cr3.modify(|_, w| w.dmar().clear_bit());
                });

                Rx {
                    pin: self.pin,
                    _usart: PhantomData,
                    _config: PhantomData,
                    _dma: PhantomData,
                }
            }
        }

        impl<Pin, Config> hal::serial::Read<u8> for Rx<$USARTX, Pin, Config, NoDMA> {
            type Error = Error;

