stm32-rs/stm32g4xx-hal/src/serial/usart.rs
                let clk = <$USARTX as RccBus>::Bus::get_frequency(&rcc.clocks).0 as u64;
                let bdr = config.baudrate.0 as u64;
                let clk_mul = 1;
                let div = (clk_mul * clk) / bdr;
                usart.brr.write(|w| unsafe { w.bits(div as u32) });

                usart.cr1.reset();
                usart.cr2.reset();
                usart.cr3.reset();

                usart.cr2.write(|w| unsafe {
                    w.stop()
                        .bits(config.stopbits.bits())
                        .swap()
                        .bit(config.swap)
                });

                if let Some(timeout) = config.receiver_timeout {
                    usart.cr1.write(|w| w.rtoie().set_bit());
                    usart.cr2.modify(|_, w| w.rtoen().set_bit());
                    usart.rtor.write(|w| unsafe { w.rto().bits(timeout) });
                }

                usart.cr3.write(|w| unsafe {
                    w.txftcfg()
                        .bits(config.tx_fifo_threshold.bits())
                        .rxftcfg()
                        .bits(config.rx_fifo_threshold.bits())
                        .txftie()
                        .bit(config.tx_fifo_interrupt)
                        .rxftie()
                        .bit(config.rx_fifo_interrupt)
                });

                usart.cr1.modify(|_, w| {
                    w.ue()
                        .set_bit()
                        .te()
                        .set_bit()
                        .re()
                        .set_bit()
                        .m0()
                        .bit(config.wordlength == WordLength::DataBits7)
                        .m1()
                        .bit(config.wordlength == WordLength::DataBits9)
                        .pce()
                        .bit(config.parity != Parity::ParityNone)
                        .ps()
                        .bit(config.parity == Parity::ParityOdd)
                        .fifoen()
                        .bit(config.fifo_enable)
                });

                Ok(Serial {
                    tx: Tx {
                        pin: tx,
                        usart,
                        _config: PhantomData,
                        _dma: PhantomData,
                    },
                    rx: Rx {
                        pin: rx,
                        _usart: PhantomData,
                        _config: PhantomData,
                        _dma: PhantomData,
                    },
                    _config: PhantomData,
                })
            }

            /// Starts listening for an interrupt event
            pub fn listen(&mut self, event: Event) {
                match event {
                    Event::Rxne => self.tx.usart.cr1.modify(|_, w| w.rxneie().set_bit()),
                    Event::Txe => self.tx.usart.cr1.modify(|_, w| w.txeie().set_bit()),
                    Event::Idle => self.tx.usart.cr1.modify(|_, w| w.idleie().set_bit()),
                    _ => {}
                }
            }

            /// Stop listening for an interrupt event
            pub fn unlisten(&mut self, event: Event) {
                match event {
                    Event::Rxne => self.tx.usart.cr1.modify(|_, w| w.rxneie().clear_bit()),
                    Event::Txe => self.tx.usart.cr1.modify(|_, w| w.txeie().clear_bit()),
                    Event::Idle => self.tx.usart.cr1.modify(|_, w| w.idleie().clear_bit()),
                    _ => {}
                }
            }

            /// Check if interrupt event is pending
            pub fn is_pending(&mut self, event: Event) -> bool {
                (self.tx.usart.isr.read().bits() & event.val()) != 0
            }

            /// Clear pending interrupt
            pub fn unpend(&mut self, event: Event) {
                // mask the allowed bits
                let mask: u32 = 0x123BFF;
                self.tx
                    .usart
                    .icr
                    .write(|w| unsafe { w.bits(event.val() & mask) });
            }
        }

        impl<Pin, Dma> Tx<$USARTX, Pin, FullConfig, Dma> {
            /// Returns true if the tx fifo threshold has been reached.
            pub fn fifo_threshold_reached(&self) -> bool {
                let usart = unsafe { &(*$USARTX::ptr()) };
                usart.isr.read().txft().bit_is_set()
            }
        }

        impl<Pin, Dma> Rx<$USARTX, Pin, FullConfig, Dma> {
            /// Check if receiver timeout has lapsed
            /// Returns the current state of the ISR RTOF bit
            pub fn timeout_lapsed(&self) -> bool {
                let usart = unsafe { &(*$USARTX::ptr()) };
                usart.isr.read().rtof().bit_is_set()
            }

            /// Clear pending receiver timeout interrupt
            pub fn clear_timeout(&mut self) {
                let usart = unsafe { &(*$USARTX::ptr()) };
                usart.icr.write(|w| w.rtocf().set_bit());
            }

            /// Returns true if the rx fifo threshold has been reached.
            pub fn fifo_threshold_reached(&self) -> bool {
                let usart = unsafe { &(*$USARTX::ptr()) };
                usart.isr.read().rxft().bit_is_set()
            }
        }
    };
}

uart_shared!(USART1, USART1_RX, USART1_TX,
tx: [
    (PA9, AF7),
    (PB6, AF7),
    (PC4, AF7),
    (PE0, AF7),
    #[cfg(any(feature = "stm32g471", feature = "stm32g473", feature = "stm32g474", feature = "stm32g483", feature = "stm32g484"))]
    (PG9, AF7),
],
rx: [
    (PA10, AF7),
    (PB7, AF7),
    (PC5, AF7),
    (PE1, AF7),
]);

uart_shared!(USART2, USART2_RX, USART2_TX,
    tx: [
        (PA2, AF7),
        (PA14, AF7),
        (PB3, AF7),
        (PD5, AF7),
    ],
    rx: [
        (PA3, AF7),
        (PA15, AF7),
        (PB4, AF7),
        (PD6, AF7),
    ]
);

uart_shared!(USART3, USART3_RX, USART3_TX,
    tx: [
        (PB9, AF7),
        (PB10, AF7),
        (PC10, AF7),
        (PD8, AF7),
    ],
    rx: [
        (PB8, AF7),
        (PB11, AF7),
        (PC11, AF7),
        (PD9, AF7),
        (PE15, AF7),
    ]
);

uart_shared!(UART4, USART4_RX, USART4_TX,
    tx: [
        (PC10, AF5),
    ],
    rx: [
        (PC11, AF5),
    ]
);

#[cfg(not(any(feature = "stm32g431", feature = "stm32g441")))]
uart_shared!(UART5, USART5_RX, USART5_TX,
    tx: [
        (PC12, AF5),
    ],
    rx: [
        (PD2, AF5),
    ]
);

uart_shared!(LPUART1, LPUART1_RX, LPUART1_TX,
    tx: [
        (PA2, AF12),
        (PB11, AF8),
        (PC1, AF8),
        #[cfg(any(feature = "stm32g471", feature = "stm32g473", feature = "stm32g474", feature = "stm32g483", feature = "stm32g484"))]
        (PG7, AF8),
    ],
    rx: [
        (PA3, AF12),
        (PB10, AF8),
        (PC0, AF8),
        #[cfg(any(feature = "stm32g471", feature = "stm32g473", feature = "stm32g474", feature = "stm32g483", feature = "stm32g484"))]
        (PG8, AF8),
    ]
);

uart_full!(USART1, usart1);
uart_full!(USART2, usart2);
uart_full!(USART3, usart3);

uart_basic!(UART4, uart4, 1);
#[cfg(not(any(feature = "stm32g431", feature = "stm32g441")))]
uart_basic!(UART5, uart5, 1);

// LPUART Should be given its own implementation when it needs to be used with features not present on
// the basic feature set such as: Dual clock domain, FIFO or prescaler.
// Or when Synchronous mode is implemented for the basic feature set, since the LP feature set does not have support.
uart_basic!(LPUART1, lpuart1, 256);
